Repository: cran/roger
Catalog: po/R-*.po
Languages: fr

source: no parse data;
fr: aucune donnée syntaxique

source: use 'getSourceData' with 'keep.source = TRUE'
fr: utiliser 'getSourceData' avec 'keep.source = TRUE'

source: Line
fr: Ligne

source: use '<-' instead of '=' for assignment
fr: utiliser '<-' plutôt que '=' pour l'affectation

source: never use a space before a comma, and always use one after
fr: ne jamais mettre une espace avant une virgule, et toujours une après

source: (unless the comma ends its line)
fr: (sauf si la virgule se trouve en fin de ligne)

source: put a space after the comment delimiters
fr: insérer une espace après les marqueurs de commentaires

source: put closing braces on their own line, aligned with their statement
fr: placer les accolades fermantes sur leur propre ligne, alignées avec leur instruction

source: put opening braces on their own line, aligned with their statement
fr: placer les accolades ouvrantes sur leur propre ligne, alignées avec leur instruction

source: put opening braces after their statement, separated by a space
fr: placer les accolades ouvrantes avec leur instruction, séparées par une espace

source: Different bracing styles used in the same file; pick one
fr: Différents styles d'accolades dans le même fichier; en choisir un seul

source: see lines
fr: voir lignes

source: no source code;
fr: aucun code source

source: No comment found
fr: Commentaires introuvables

source: No documentation found
fr: Documentation introuvable

source: No signature found for function
fr: Signature introuvable pour la fonction

source: No section matching
fr: Section correspondant à

source: found
fr: introuvable

source: Description of argument
fr: Description de l'argument

source: missing from the documentation
fr: manquante dans la documentation

source: limit line length to
fr: limiter la longueur des lignes à

source: characters.
fr: caractères.

source: potential magic number; assign to a variable
fr: nombre magique potentiel; affecter dans une variable

source: use spaces on both sides of infix operators
fr: utiliser des espaces autour des opérateurs infixés

source: do not use spaces after unary operators
fr: ne pas utiliser d'espace après les opérateurs unaires

source: do not use spaces before closing parentheses
fr: ne pas utiliser d'espace avant les parenthèses fermantes

source: do not use spaces after opening parentheses
fr: ne pas utiliser d'espaces après les parenthèses ouvrantes

source: do not use spaces before opening parentheses in function calls
fr: ne pas utiliser d'espaces avant les parenthèses dans les appels de fonctions

source: use spaces before opening parentheses (except in function calls)
fr: utiliser une espace avant les parenthèses (sauf dans les appels de fonctions)

source: do not use spaces before closing brackets (except after a comma)
fr: ne pas mettre d'espaces avant un crochet fermant (sauf après une virgule)

source: do not use spaces after opening brackets
fr: ne pas mettre d'espaces après un crochet ouvrant

source: tidy up and delete this superfluous blank line
fr: nettoyer et supprimer cette ligne vide superflue

source: tidy up and delete unnecessary trailing whitespace
fr: nettoyer et supprimer les espaces inutiles en fin de ligne

source: do not use 'c()' with 0 or 1 argument
fr: ne pas utiliser 'c()' sans ou avec un seul argument

source: %d top-level function definition found,
fr: %d définition de fonction principale trouvée,

source: but %d section matching
fr: mais %d section correspondant à
